#include <stdio.h>
typedef struct employee
{
	int number;
	char name[30];
	char phone[30];
	int age;
}EMPLOYEE;

int main(void)
{
	int i;

	EMPLOYEE e[10] = {
		{ 1, "가가가", "010-1111-1111", 20 },
		{ 2, "나나나", "010-2222-2222", 13 },
		{ 3, "다다다", "010-3333-3333", 26 },
		{ 4, "라라라", "010-4444-4444", 39 },
		{ 5, "마마마", "010-5555-5555", 41 },
		{ 6, "바바바", "010-6666-6666", 39 },
		{ 7, "사사사", "010-7777-7777", 27 },
		{ 8, "아아아", "010-8888-8888", 20 },
		{ 9, "자자자", "010-9999-9999", 23 },
		{ 10, "차차차", "010-0000-0000", 16 },
	};

	for (i = 0; i < 10; i++)
	{
		if (20 <= e[i].age && e[i].age <= 30)
		{
			printf("사번=%d 이름=%s 전화번호=%s 나이=%d\n", e[i].number, e[i].name, e[i].phone, e[i].age);
		}
	}
}